Revit 2026 API

# LinkLoadResultIsNested Property

---

True if these results represent a nested link; false otherwise.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsNested { get; }
```
```vb
Public ReadOnly Property IsNested As Boolean
	Get
```
```cpp
public:
property bool IsNested {
	bool get ();
}
```
```fsharp
member IsNested : bool with get
```

#### Property Value

Boolean

This property is only relevant for LinkLoadResult object for RvtLinkSymbol. ie. when getIsRvtLink() is true.

#### Reference

LinkLoadResult Class

Autodesk.Revit.DB Namespace